Revit 2027 API
ZoneFailures Properties
The BuiltInFailures.ZoneFailures type exposes the following members.
Properties
Name | Description
ZoneExistsNotEnclosedRoom |  Zone has a room not enclosed.
ZoneNotEnclosed |  Zone not enclosed totally.
ZonesOverlapWarning |  Zone overlap to another zone or another room.
Top
See Also
Reference
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace